models/Category.php

    public static function getCategory()
    {
        return (new \yii\db\Query())
        ->select(['title'])
        ->from ('category')
        ->indexBy('id')
        ->column()
---
SELECT `title`, `category`.`id` FROM `category`