models/RegistrationForm.php

INSERT INTO `user` (`name`, `email`, `surname`, `patronymic`, `login`, `password`, `auth_key`, `id_role`) VALUES ('user', 'hruhru@ukraine.ur', 'user', 'user', 'user', '$2y$13$cgYgh2IMWb3jSZPI.BUSv.1LbBb5qUybjTi/1NgfDKTjdniDCe0Ba', '_mU4p5L-SF9MTGeUxulNbw0-HCbz2mQ7', 2)
---
    public function registerUser(){
        if($this -> validate()){
            $user = new User();
            if($user->load($this->attributes,'')){
                if ($user ->save()){