models/Role.php

SELECT * FROM `role` WHERE `title`='admin'
---
    public static function getRole($role){
        return static::findOne(['title'=>$role])->id;