models/Tovar.php

SELECT `title`, `photo` FROM `tovar` ORDER BY `id` DESC LIMIT 5
---
    public static function getImages()
    {
        $rows = (new \yii\db\Query())
        -> select(['title','photo'])
        -> from('tovar')
        ->orderBy('id DESC')
        ->LIMIT(5)
        ->all();