models/User.php

SELECT * FROM `user` WHERE `login`='admin'
---
    public static function findByUsername($username)
    {
        return User::findOne(['login'=>$username]);